# MinimumRowHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..MinimumRowHeight Property
TableView Class See Also
---
Gets the minimum row height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int MinimumRowHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinimumRowHeight As Integer
	Get
```

Visual C++
---
```text
public:
property int MinimumRowHeight {
	int get ();
}
```

# See Also
TableView Class
Autodesk.Revit.DB Namespace